1:30 time

Output:
- К сожалению, баллов, которые вы набрали, недостаточно, чтобы пройти на следующий этап. Ваш результат:
- 28.947368421052634 / 180
- Не расстраивайтесь. Возможно, нужно немного подучиться и попробовать снова, и тогда всё точно получится
** solution
#+begin_src python :results output :exports both :session s1
inp = input() # "12 1234"
n = int(inp.split(" ")[0])
m = int(inp.split(" ")[1])
found = []
r = m if n> m else n
# print(r)
l = len(str(m if n< m else n))
# print(str(r).zfill(l))
for i in range(r):
    s = str(i).zfill(l)
    rev = "".join(list(reversed(str(i).zfill(l))))
    rev_int = int(rev)
    # print("rev_int", rev_int)
    if rev_int >= m:
        continue
    # print(s, rev)
    # if str(i).zfill(l) == "".join(list(reversed(str(i).zfill(l)))):
    found.append(str(i))
print(len(found))
#+end_src

#+RESULTS:
: 4
** solution
#+begin_src python :results output :exports both :session s1
# solution = """2 4
# 1679982033000 441079aa62dc3cd57df3
# 1679982033998 441079aa62dc3cd57df3
# 1679982033999 441079aa62dc3cd57df3
# 1679982034000 441079aa62dc3cd57df3"""
solution = input()
# print(solution)
p1 = solution.split("\n")[0]
n = int(p1.split(" ")[0])
m = p1.split(" ")[1]
solution = []
for _ in range(m):
    solution = input()
pn = solution.split("\n")
# print(n, m)
sl = 0
sl2 = ""
processed = dict()
save = []
for l in pn:
    l1 = int(l.split(" ")[0])
    l2 = l.split(" ")[1]
    # print(l1 -sl)
    k = processed[l2] if l2 in processed else 0
    if l1 - k >= n :
        processed[l2] = l1
        save.append(l)
[print(x) for x in save]
#+end_src

#+RESULTS:
: 1679982033000 441079aa62dc3cd57df3
: 1679982033998 441079aa62dc3cd57df3
: 1679982034000 441079aa62dc3cd57df3
